[
  {
    "company": "42 Layers",
    "website": "https://42layers.io",
    "location": "Seattle, WA",
    "title": "Software Developer",
    "startDate": "Mar. 2020",
    "endDate": "Current",
    "descriptions": [
      "Working to provide automation solutions to business to help cut down on menial work and connect isolated systems",
      "Primarily writing in Rust; also using WebAssembly on the backend.",
      "Full-Stack webdev and systems programming.  I build frontends using TypeScript+React, APIs with Rust/gRPC/PostgreSQL/BigQuery and other tech",
      "Work on low-level optimization for a mission critical component of the system for which performance is critical"
    ]
  },
  {
    "company": "Stackline",
    "website": "https://www.stackline.com/",
    "location": "Seattle, WA",
    "title": "Software Developer",
    "startDate": "Feb. 2019",
    "endDate": "Mar. 2020",
    "descriptions": [
      "I workd as a full-stack software developer at Stackline, working on their three flagship software offerings.",
      "I used React/Redux on the frontend, fixing bugs and adding new features.  I also contributed to various internal APIs, developer utilities (CI/CD, automated testing, etc.) and other projects.",
      "Fleshed out an extensive testing solution from scratch for all web-facing products testing user interaction via Cypress, API response schema validation, and unit tests.",
      "Led the effort to incrementally migrating the codebase to TypeScript, creating a set of cohesive types shared between the frontend and backend.",
      "Completely re-implemented the main search API (used to query business data for all user-facing services) from scratch.  Re-implemented additional services from existing C# monolith.",
      "Created several tools for internal use, aiding other employees with report generation, data fetching, and task automation."
    ]
  },
  {
    "company": "FatWhale",
    "website": null,
    "location": "Remote",
    "title": "Software Developer",
    "startDate": "Sept. 2017",
    "endDate": "Jul. 2018",
    "descriptions": [
      "Designed and developed software to aid with the collection, processing, and storage of cryptocurrency market data",
      "Constructed a fully automated trading framework for trading on many cryptocurrency exchanges",
      "Designed software applications and prepared documentation for other developers",
      "Set up CI/CD pipelines using CircleCI, Kubernetes/GKE, and managed code reviews and version control"
    ]
  },
  {
    "company": "Trabian Technology",
    "website": "https://www.trabian.com/",
    "location": "Remote",
    "title": "Software Developer",
    "startDate": "Sept. 2017",
    "endDate": "Jul. 2018",
    "descriptions": [
      "Stayed on remotely part-time after my internship working on on React applications for clients in the financial sector"
    ]
  },
  {
    "company": "Trabian Technology",
    "website": "https://www.trabian.com/",
    "location": "Indianaplis, IN",
    "title": "Software Developer Intern",
    "startDate": "May. 2017",
    "endDate": "Aug. 2018",
    "descriptions": [
      "Worked on client projects including web and mobile applications for the financial sector",
      "Implemented new features + fixed bugs using a Github-based workflow; React + React Native, Redux",
      "Took part in code reviews and pair programming"
    ]
  },
  {
    "company": "Valparaiso University",
    "website": "https://valpo.edu/",
    "location": "Valparaiso, IN",
    "title": "Undergraduate Researcher / Software Developer",
    "startDate": "Jun. 2016",
    "endDate": "Aug. 2016",
    "descriptions": [
      "Extended the Orange3 platform to allow for code exportation from visual programming workflows to Python scripts"
    ]
  },
  {
    "company": "Valparaiso University",
    "website": "https://valpo.edu/",
    "location": "Valparaiso, IN",
    "title": "Undergraduate Researcher / Software Developer",
    "startDate": "May. 2016",
    "endDate": "Jun. 2016",
    "descriptions": [
      "Developed software for network research and analysis (https://github.com/Ameobea/network_research) and prototype network repository for storage of network data (https://github.com/Ameobea/network_database)"
    ]
  }
]
